# EnterValueBetween Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeneralFailures..::..EnterValueBetween Property
BuiltInFailures..::..GeneralFailures Class See Also
---
Please enter a value between [Value] and [Value].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId EnterValueBetween { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnterValueBetween As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ EnterValueBetween {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeneralFailures Class
Autodesk.Revit.DB Namespace